app/views/jobs/index.html.erb

    <td>
      <% job.contacts.each do|contact| %>
---
SELECT "contacts".* FROM "contacts" INNER JOIN "jobconnections" ON "contacts"."id" = "jobconnections"."contact_id" WHERE "jobconnections"."job_id" = 69