app/views/contacts/index.html.erb

SELECT "companies".* FROM "companies" INNER JOIN "contactcompanyjoins" ON "companies"."id" = "contactcompanyjoins"."company_id" WHERE "contactcompanyjoins"."contact_id" = 142
---
    <td>
        <% contact.companies.each do |company| %>