app/views/contacts/show.html.erb

SELECT "companies".* FROM "companies" INNER JOIN "contactcompanyjoins" ON "companies"."id" = "contactcompanyjoins"."company_id" WHERE "contactcompanyjoins"."contact_id" = 1
---
    <strong>Company Name:</strong>
    <% @contact.companies.each do |company| %>