app/views/companies/show.html.erb

  <strong>My <%= @company.companyname %> Contacts:</strong>
  <% @company.contacts.each do |contact| %>
---
SELECT "contacts".* FROM "contacts" INNER JOIN "contactcompanyjoins" ON "contacts"."id" = "contactcompanyjoins"."contact_id" WHERE "contactcompanyjoins"."company_id" = 3