app/controllers/companies_controller.rb

  def edit
    @company = Company.find(params[:id])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "15"]]

  def index
    @companies = current_user.companies.uniq.sort_by{|p| p.contacts.count}.reverse
---
SELECT "companies".* FROM "companies"

  def show
    @company = Company.find(params[:id])
    # @job = current_user.jobs.find(params[:id])
    @my_companies_contacts = current_user.contacts.select do |contact| contact.companies.include? @company end
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "13"]]
SELECT "contacts".* FROM "contacts" INNER JOIN "contactcompanyjoins" ON "contacts"."id" = "contactcompanyjoins"."contact_id" WHERE "contactcompanyjoins"."company_id" = 3

  def create
    raise params[:company].inspect
    @company = Company.new(params[:company])
    if @company.save
---
INSERT INTO "companies" ("companyname", "companynotes", "contact_id", "created_at", "industry", "job_id", "updated_at", "user_id", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @company = Company.find(params[:id])
    @company.update_attributes(params[:company])
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "15"]]
UPDATE "companies" SET "website" = 'groupon.com', "industry" = 'retail/service', "companynotes" = 'fastest growing company in the world', "updated_at" = '2011-12-08 15:58:26.484015' WHERE "companies"."id" = 7

  def destroy
    @company = Company.find(params[:id])
    @company.destroy
---
SELECT "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", "13"]]
DELETE FROM "companies" WHERE "companies"."id" = ?  [["id", 13]]