app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("company_id", "created_at", "email", "facebook", "faxnumber", "firstname", "job_connection_id", "jobtitle", "lastname", "linkedin", "mainphone", "meetup_url", "meetups", "otherinfo", "twitter", "updated_at", "user_id", "workphone") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @contact = Contact.new(params[:contact])
    @contact.user = current_user

    if @contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "contacts" SET "mainphone" = 987654321, "updated_at" = '2011-11-28 21:21:35.353592' WHERE "contacts"."id" = 1
---
  def update
    @contact = Contact.find(params[:id])
    @contact.update_attributes(params[:contact])

DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 2]]
---
  def destroy
    @contact.destroy

SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "2"]]
---
  def set_contact
    if current_user.contacts.find_by_id(params[:id])

SELECT "companies".* FROM "companies" WHERE "companies"."companyname" = 'Verizon BIKES' LIMIT 1
INSERT INTO "companies" ("companyname", "companynotes", "created_at", "industry", "updated_at", "user_id", "website") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def find_or_create_company(name)
    if Company.find_by_companyname(name).present?
      @company = Company.find_by_companyname(name)
    else
      @company = Company.create :companyname => name